#include<stdio.h>
#include<stdlib.h>
#include<time.h>
//
////int main() {
//	//设置种子
//	//srand(2);
//
//	//
//	//for (int i = 0; i < 11; i++)
//	//{
//	//	//获取随机数
//	//	int num = rand();
//	//	//输出打印
//	//	printf("%d\n", num);
//
//	//}
//	
//	/* 1.随机数的两个小弊端，随机数的结果是固定的
//	   2.随机数的范围 0~32767
//	   8~49
//	   用于生成任意范围之内的随机数
//	   1.把这个范围变成包头不包尾，包左不包右的 8~50
//	   2.尾巴-开头  50-8=42
//	   
//	   
//	   
//	   
//	   */
//
//	//1.设置种子 
//	//srand(time(NULL));
//
//	//2.获取随机数
//	//int num = rand() % 42 + 8;
//	//输出
//	//printf("%d\n", num);
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
////}