//#include<stdio.h>
//
//int main()
//{
//
///*	有意义的操作：1.指针和整数进行加减
//				 2.指针和指针进行减操作（间隔的步长）
//
//	无意义的操作：
//				指针和整数乘除操作
//				指针和指针进行+ * /
//*/
//	int arr[] = { 1,2,3,4,5,6,7 };  //数据必须是连续的
//
//	int* p1 = &arr[0];  //&:获取地址.
//	printf("%d\n", *p1);
//	printf("%d\n", *(p1+1));
//	printf("%d\n", *(p1 + 2));
//	printf("%d\n", *(p1 + 3));
//
//	int* p2 = &arr[0];
//	int* p3 = &arr[5];
//	int a = p3 - p2;
//	printf("间隔%d", a);
//
//
//
//
//
//
//
//
//
//
//
//
//}